#!/bin/bash
set -o history
HISTFILE=~/.bash_history

TERM=dumb script "${USER}_part.log"
echo "======================================================================"
echo "screen -S \${USER}_part2"
echo "---> screen -ls"
screen -ls
echo "Успешно создали сессию ${USER}_part2"
echo "======================================================================"
echo "Все команды, которые начинаются на «ls»."
echo "---> compgen -c ls | sort -u"
compgen -c ls | sort -u
echo "======================================================================"
echo "Все переменные, которые начинаются с «HIST»."
echo "---> compgen -v HIST"
compgen -v HIST
echo "======================================================================"
echo "---> echo \$HISTFILESIZE"
echo "Количество комманд которые может содержат .bash_history файл: $HISTFILESIZE."
echo "---> echo \$HISTSIZE"
echo "Количество комманд которые может содержат КЭШ исстория буффер: $HISTSIZE."
echo "======================================================================"
echo "Все файлы и каталоги которые в домашном каталоге начинаются с «.»"
echo "---> ls -d ~/.*"
ls -d ~/.*
echo "======================================================================"
echo "Настройка вывод даты выполнения команд, хранящихся в истории."
echo "===================До=========================="
echo "---> history 10"
history 10
echo "---> HISTTIMEFORMAT="%Y-%m-%d %H:%M:%S""
HISTTIMEFORMAT="%Y-%m-%d %H:%M:%S"
echo "==================После========================"
echo "---> history 10"
history 10
echo "======================================================================"
echo "Настройка автоматическое сохранение набираемых команд в файле"
echo "==============================================="
echo "===================До=========================="
echo "==============================================="
echo "---> date"
date
echo "Исстория последных 10 комманд данного Терминала"
echo "---> history 10"
history 10
echo "Исстория последных 10 комманд .bash_history файла"
echo "---> tail -n 10 ~/.bash_history"
tail -n 10 ~/.bash_history
echo "==============================================="
echo "==================После========================"
echo "==============================================="
echo "---> PROMPT_COMMAND='history -a'"
PROMPT_COMMAND="history -a"
echo "---> whoami"
whoami
echo "Исстория последных 10 комманд данного Терминала"
echo "---> history 10"
history 10
echo "Исстория последных 10 комманд .bash_history файла"
echo "---> tail -n 10 ~/.bash_history"
tail -n 10 ~/.bash_history
echo "======================================================================"
echo "Переменные DATE и TIME"
echo "---> DATE=\$(date +%Y-%m-%d)"
DATE=$(date +%Y-%m-%d)
echo "Дата = $DATE"
echo "---> TIME=\$(date +%H:%M:%S)"
TIME=$(date +%H:%M:%S)
echo "Время = $TIME"
echo "---> DATE_TIME='\$DATE \$TIME'"
DATE_TIME="$DATE $TIME"
echo "Дата и Время = $DATE_TIME"
echo "======================================================================"
echo "Имена файлов, содержащие хотя бы одну цифру, из каталогов /bin и /sbin."
echo "---> ls -d /bin/*[0-9]* /sbin/*[0-9]* "
ls -d /bin/*[0-9]* /sbin/*[0-9]*
echo "ИЛИ"
echo "---> ls /bin /sbin | grep '[0-9]'"
ls /bin /sbin | grep '[0-9]'
echo "======================================================================"
echo "Измениние приглашение на имя_пользователя@имя_хоста-HH:MM>"
echo "---> PS1='\u@\h-\$(date +%H:%M)> \'"
PS1="\u@\h-$(date +%H:%M)> "
echo "---> export PS1"
export PS1
echo "---> bash --norc"
bash --norc
echo "======================================================================"
echo "создание в домашнем каталоге подкаталоги для каждого месяца текущего года вида YYYY-MM"
echo "---> mkdir -p '\$(date +%Y)'-{01..12}"
mkdir -p "$(date +%Y)"-{01..12}
echo "======================================================================"